In [3]:
import numpy as np

In [4]:
import pandas as pd

In [14]:
data = {'company':['google','google','microsoft','microsoft','facebook','facebook'],'person':['sam','charlie','amy','vanessa','carl','sarah'],
        'sales':[200,120,340,124,243,350]}

In [15]:
df = pd.DataFrame(data)

In [16]:
df

     company   person  sales
0     google      sam    200
1     google  charlie    120
2  microsoft      amy    340
3  microsoft  vanessa    124
4   facebook     carl    243
5   facebook    sarah    350

In [19]:
groupbydf = df.groupby('company') # now we will use group by now if you use it in this way you will get 
#the below output and you need to 
# put this result in some variable to the proper output

In [20]:
groupbydf # we have not put any aggregate function

In [25]:
df.groupby('company').sum() # so python by default chooses the numerical column and output the result in this case it was sales

           sales
company
facebook     593
google       320
microsoft    464

In [35]:
# Above is one way another way is we put this in one variable and then we aggregate.

In [43]:
groupbydf.sum().loc['google'] # that's how you can index a single group by value

sales    320
Name: google, dtype: int64

In [44]:
groupbydf.sum().loc[['google','microsoft']]

           sales
company
google       320
microsoft    464

In [45]:
groupbydf.min()

            person  sales
company
facebook      carl    243
google     charlie    120
microsoft      amy    124

In [46]:
groupbydf.max()

            person  sales
company
facebook     sarah    350
google         sam    200
microsoft  vanessa    340

In [49]:
groupbydf.describe().transpose() # this way you can transpose your result

company        facebook      google   microsoft
sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [48]:
df.describe() # this is how we can get the general idea on how to get all the counts together

            sales
count    6.000000
mean   229.500000
std    100.899455
min    120.000000
25%    143.000000
50%    221.500000
75%    315.750000
max    350.000000